from kivy.uix.button import Button
from kivy.uix.image import Image
from kivy.uix.screenmanager import Screen
from kivy.animation import Animation
from kivy.uix.spinner import Spinner, SpinnerOption
from kivy.metrics import sp

from sistem import BackButton

# Example mapping of interface text to different languages



class LanguageData():
    text_map = {
        'ru': {
            'languages': ['Украинский', 'Русский'],
            'mein_menu_title': 'Главное меню',
            'settings_title': 'Настройки',
            'campaign_title': 'Кампания',
            'mode_title': 'Варианты',
            'run_round_title': 'Запустить раунд',
            'exit_title': 'Выход',
            'sentences_pair': {
                'PresentContinuous': {
                    '+': [
                        ['я работаю (состояние)', 'I am working'],
                        ['Мы работаем (состояние)', 'We are working'],
                        ['Они работают (состояние)', 'They are working'],
                        ['Ты работаешь (состояние)', 'You are working'],
                        ['Он работает (состояние)', 'He is working'],
                        ['Она работает (состояние)', 'She is working'],
                        ['Это работает (состояние)', 'It is working'],
                    ],
                    '-': [
                        ['я не работаю (состояние)', 'I amn\'t working'],
                        ['Мы не работаем (состояние)', 'We aren\'t working'],
                        ['Они не работают (состояние)', 'They aren\'t working'],
                        ['Ты не работаешь (состояние)', 'You aren\'t working'],
                        ['Он не работает (состояние)', 'He isn\'t working'],
                        ['Она не работает (состояние)', 'She isn\'t working'],
                        ['Это не работает (состояние)', 'It isn\'t working'],
                    ],
                    '?': [
                        ['Я работаю? (состояние)', 'Am I working'],
                        ['Мы работаем? (состояние)', 'Are we working'],
                        ['Они работают? (состояние)', 'Are they working'],
                        ['Ты работаешь? (состояние)', 'Are you working'],
                        ['Он работает? (состояние)', 'Is he working'],
                        ['Она работает? (состояние)', 'Is she working'],
                        ['Это работает? (состояние)', 'Is it working'],
                    ],
                },
                'PastContinuous': {
                    '+': [
                        ['я работал (состояние)', 'I was working'],
                        ['Мы работали (состояние)', 'We were working'],
                        ['Они работали (состояние)', 'They were working'],
                        ['Ты работал (состояние)', 'You were working'],
                        ['Он работал (состояние)', 'He was working'],
                        ['Она работала (состояние)', 'She was working'],
                        ['Это работало (состояние)', 'It was working'],
                    ],
                    '-': [
                        ['я не работал (состояние)', 'I wasn\'t working'],
                        ['Мы не работали (состояние)', 'We weren\'t working'],
                        ['Они не работали (состояние)', 'They weren\'t working'],
                        ['Ты не работал (состояние)', 'You weren\'t working'],
                        ['Он не работал (состояние)', 'He wasn\'t working'],
                        ['Она не работала (состояние)', 'She wasn\'t working'],
                        ['Это не работало (состояние)', 'It wasn\'t working'],
                    ],
                    '?': [
                        ['Я работал? (состояние)', 'Was I working'],
                        ['Мы работали? (состояние)', 'Were we working'],
                        ['Они работали? (состояние)', 'Were they working'],
                        ['Ты работал? (состояние)', 'Were you working'],
                        ['Он работал? (состояние)', 'Was he working'],
                        ['Она работала? (состояние)', 'Was she working'],
                        ['Это работало? (состояние)', 'Was it working'],
                    ],
                },
                'FutureContinuous': {
                    '+': [
                        ['Я буду работать (состояние)', 'I will be working'],
                        ['Ты будешь работать (состояние)', 'You will be working'],
                        ['Они будут работать (состояние)', 'They will be working'],
                        ['Мы будем работать (состояние)', 'We will be working'],
                        ['Он будет работать (состояние)', 'He will be working'],
                        ['Она будет работать (состояние)', 'She will be working'],
                        ['Это будет работать (состояние)', 'It will be working'],
                    ],
                    '-': [
                        ['Я не буду работать (состояние)', 'I won\'t be working'],
                        ['Ты не будешь работать (состояние)', 'You won\'t be working'],
                        ['Они не будут работать (состояние)', 'They won\'t be working'],
                        ['Мы не будем работать (состояние)', 'We won\'t be working'],
                        ['Он не будет работать (состояние)', 'He won\'t be working'],
                        ['Она не будет работать (состояние)', 'She won\'t be working'],
                        ['Это не будет работать (состояние)', 'It won\'t be working'],
                    ],
                    '?': [
                        ['Я буду работать? (состояние)', 'Will I be working'],
                        ['Ты будешь работать? (состояние)', 'Will you be working'],
                        ['Они будут работать? (состояние)', 'Will they be working'],
                        ['Мы будем работать? (состояние)', 'Will we be working'],
                        ['Он будет работать? (состояние)', 'Will he be working'],
                        ['Она будет работать? (состояние)', 'Will she be working'],
                        ['Это будет работать? (состояние)', 'Will it be working'],
                    ],
                },

                'PresentIndefinite': {
                    '+': [
                        ['я работаю (повторяющееся)', 'I work'],
                        ['Мы работаем (повторяющееся)', 'We work'],
                        ['Они работают (повторяющееся)', 'They work'],
                        ['Ты работаешь (повторяющееся)', 'You work'],
                        ['Он работает (повторяющееся)', 'He works'],
                        ['Она работает (повторяющееся)', 'She works'],
                        ['Это работает (повторяющееся)', 'It works'],
                    ],
                    '-': [
                        ['я не работаю (повторяющееся)', 'I don\'t work'],
                        ['Мы не работаем (повторяющееся)', 'We don\'t work'],
                        ['Они не работают (повторяющееся)', 'They don\'t work'],
                        ['Ты не работаешь (повторяющееся)', 'You don\'t work'],
                        ['Он не работает (повторяющееся)', 'He doesn\'t work'],
                        ['Она не работает (повторяющееся)', 'She doesn\'t work'],
                        ['Это не работает (повторяющееся)', 'It doesn\'t work'],
                    ],
                    '?': [
                        ['я работаю? (повторяющееся)', 'Do I work'],
                        ['Мы работаем? (повторяющееся)', 'Do we work'],
                        ['Они работают? (повторяющееся)', 'Do they work'],
                        ['Ты работаешь? (повторяющееся)', 'Do you work'],
                        ['Он работает? (повторяющееся)', 'Does he work'],
                        ['Она работает? (повторяющееся)', 'Does she work'],
                        ['Это работает? (повторяющееся)', 'Does it work'],
                    ],
                },
                'PastIndefinite': {
                    '+': [
                        ['я работал (повторяющееся)', 'I worked'],
                        ['Он работал (повторяющееся)', 'He worked'],
                        ['Мы работали (повторяющееся)', 'We worked'],
                        ['Они работали (повторяющееся)', 'They worked'],
                        ['Ты работал (повторяющееся)', 'You worked'],
                        ['Она работала (повторяющееся)', 'She worked'],
                        ['Это работало (повторяющееся)', 'It worked'],
                    ],
                    '-': [
                        ['Я не работал (повторяющееся)', 'I didn\'t work'],
                        ['Мы не работали (повторяющееся)', 'We didn\'t work'],
                        ['Они не работали (повторяющееся)', 'They didn\'t work'],
                        ['Ты не работал (повторяющееся)', 'You didn\'t work'],
                        ['Он не работал (повторяющееся)', 'He didn\'t work'],
                        ['Она не работала (повторяющееся)', 'She didn\'t work'],
                        ['Это не работало (повторяющееся)', 'It didn\'t work'],
                    ],
                    '?': [
                        ['я работал? (повторяющееся)', 'Did I work'],
                        ['Мы работали? (повторяющееся)', 'Did we work'],
                        ['Они работали? (повторяющееся)', 'Did they work'],
                        ['Ты работал? (повторяющееся)', 'Did you work'],
                        ['Он работал? (повторяющееся)', 'Did he work'],
                        ['Она работала? (повторяющееся)', 'Did she work'],
                        ['Это работало? (повторяющееся)', 'Did it work'],
                    ],
                },
                'FutureIndefinite': {
                    '+': [
                        ['Я буду работать (повторяющееся)', 'I will work'],
                        ['Мы будем работать (повторяющееся)', 'We will work'],
                        ['Они буду работать (повторяющееся)', 'They will work'],
                        ['Ты будешь работать (повторяющееся)', 'You will work'],
                        ['Он будет работать (повторяющееся)', 'He will work'],
                        ['Она будет работать (повторяющееся)', 'She will work'],
                        ['Это будет работать (повторяющееся)', 'It will work'],
                    ],
                    '-': [
                        ['Я не буду работать (повторяющееся)', 'I won\'t work'],
                        ['Мы не будем работать (повторяющееся)', 'We won\'t work'],
                        ['Они не буду работать (повторяющееся)', 'They won\'t work'],
                        ['Ты не будешь работать (повторяющееся)', 'You won\'t work'],
                        ['Он не будет работать (повторяющееся)', 'He won\'t work'],
                        ['Она не будет работать (повторяющееся)', 'She won\'t work'],
                        ['Это не будет работать (повторяющееся)', 'It won\'t work'],
                    ],
                    '?': [
                        ['Я буду работать? (повторяющееся)', 'Will I work'],
                        ['Мы будем работать? (повторяющееся)', 'Will we work'],
                        ['Они буду работать? (повторяющееся)', 'Will they work'],
                        ['Ты будешь работать? (повторяющееся)', 'Will you work'],
                        ['Он будет работать? (повторяющееся)', 'Will he work'],
                        ['Она будет работать? (повторяющееся)', 'Will she work'],
                        ['Это будет работать? (повторяющееся)', 'Will it work'],
                    ],
                },

                'PresentPerfect': {
                    '+': [
                        ['Я работал (есть опыт)', 'I have worked'],
                        ['Мы работали (есть опыт)', 'We have worked'],
                        ['Ты работал (есть опыт)', 'You have worked'],
                        ['Они работали (есть опыт)', 'They have worked'],
                        ['Он работал (есть опыт)', 'He has worked'],
                        ['Она работала (есть опыт)', 'She has worked'],
                        ['Это работало (есть опыт)', 'It has worked'],
                    ],
                    '-': [
                        ['Я не работал (нет опыта)', 'I haven\'t worked'],
                        ['Мы не работали (нет опыта)', 'We haven\'t worked'],
                        ['Ты не работал (нет опыта)', 'You haven\'t worked'],
                        ['Они не работали (нет опыта)', 'They haven\'t worked'],
                        ['Он не работал (нет опыта)', 'He hasn\'t worked'],
                        ['Она не работала (нет опыта)', 'She hasn\'t worked'],
                        ['Это не работало (нет опыта)', 'It hasn\'t worked'],
                    ],
                    '?': [
                        ['Я работал? (есть опыт)', 'Have I worked'],
                        ['Мы работали? (есть опыт)', 'Have we worked'],
                        ['Ты работал? (есть опыт)', 'Have you worked'],
                        ['Они работали? (есть опыт)', 'Have they worked'],
                        ['Он работал? (есть опыт)', 'Has he worked'],
                        ['Она работала? (есть опыт)', 'Has she worked'],
                        ['Это работало? (есть опыт)', 'Has it worked'],
                    ],
                },
                'PastPerfect': {
                    '+': [
                        ['Я работал (позапрошлое)', 'I had worked'],
                        ['Мы работали (позапрошлое)', 'We had worked'],
                        ['Ты работал (позапрошлое)', 'You had worked'],
                        ['Они работали (позапрошлое)', 'They had worked'],
                        ['Он работал (позапрошлое)', 'He had worked'],
                        ['Она работала (позапрошлое)', 'She had worked'],
                        ['Это работало (позапрошлое)', 'It had worked'],
                    ],
                    '-': [
                        ['Я не работал (позапрошлое)', 'I hadn\'t worked'],
                        ['Мы не работали (позапрошлое)', 'We hadn\'t worked'],
                        ['Ты не работал (позапрошлое)', 'You hadn\'t worked'],
                        ['Они не работали (позапрошлое)', 'They hadn\'t worked'],
                        ['Он не работал (позапрошлое)', 'He hadn\'t worked'],
                        ['Она не работала (позапрошлое)', 'She hadn\'t worked'],
                        ['Это не работало (позапрошлое)', 'It hadn\'t worked'],
                    ],
                    '?': [
                        ['Я работал? (позапрошлое)', 'Had I worked'],
                        ['Мы работали? (позапрошлое)', 'Had we worked'],
                        ['Ты работал? (позапрошлое)', 'Had you worked'],
                        ['Они работали? (позапрошлое)', 'Had they worked'],
                        ['Он работал? (позапрошлое)', 'Had he worked'],
                        ['Она работала? (позапрошлое)', 'Had she worked'],
                        ['Это работало? (позапрошлое)', 'Had it worked'],
                    ],
                },
                'FuturePerfect': {
                    '+': [
                        ['Я буду работать (к тому времени)', 'I will have worked'],
                        ['Мы будем работать (к тому времени)', 'We will have worked'],
                        ['Ты будешь работать (к тому времени)', 'You will have worked'],
                        ['Они буду работать (к тому времени)', 'They will have worked'],
                        ['Он будет работать (к тому времени)', 'He will have worked'],
                        ['Она будет работать (к тому времени)', 'She will have worked'],
                        ['Это будет работать (к тому времени)', 'It will have worked'],
                    ],
                    '-': [
                        ['Я не буду работать (к тому времени)', 'I won\'t have worked'],
                        ['Мы не будем работать (к тому времени)', 'We won\'t have worked'],
                        ['Ты не будешь работать (к тому времени)', 'You won\'t have worked'],
                        ['Они не буду работать (к тому времени)', 'They won\'t have worked'],
                        ['Он не будет работать (к тому времени)', 'He won\'t have worked'],
                        ['Она не будет работать (к тому времени)', 'She won\'t have worked'],
                        ['Это не будет работать (к тому времени)', 'It won\'t have worked'],
                    ],
                    '?': [
                        ['Я буду работать? (к тому времени)', 'Will I have worked'],
                        ['Мы будем работать? (к тому времени)', 'Will we have worked'],
                        ['Ты будешь работать? (к тому времени)', 'Will you have worked'],
                        ['Они буду работать? (к тому времени)', 'Will they have worked'],
                        ['Он будет работать? (к тому времени)', 'Will he have worked'],
                        ['Она будет работать? (к тому времени)', 'Will she have worked'],
                        ['Это будет работать? (к тому времени)', 'Will it have worked'],
                    ],
                },

                'PresentPerfectContinuous': {
                    '+': [
                        ['Я работал (длится по сейчас)', 'I have been working'],
                        ['Мы работали (длится по сейчас)', 'We have been working'],
                        ['Ты работал (длится по сейчас)', 'You have been working'],
                        ['Они работали (длится по сейчас)', 'They have been working'],
                        ['Он работал (длится по сейчас)', 'He has been working'],
                        ['Она работала (длится по сейчас)', 'She has been working'],
                        ['Это работало (длится по сейчас)', 'It has been working'],
                    ],
                    '-': [
                        ['Я не работал (не длилось по сейчас)', 'I haven\'t been working'],
                        ['Мы не работали (не длилось по сейчас)', 'We haven\'t been working'],
                        ['Ты не работал (не длилось по сейчас)', 'You haven\'t been working'],
                        ['Они не работали (не длилось по сейчас)', 'They haven\'t been working'],
                        ['Он не работал (не длилось по сейчас)', 'He hasn\'t been working'],
                        ['Она не работала (не длилось по сейчас)', 'She hasn\'t been working'],
                        ['Это не работало (не длилось по сейчас)', 'It hasn\'t been working'],
                    ],
                    '?': [
                        ['Я работал? (длится по сейчас)', 'Have I been working'],
                        ['Мы работали? (длится по сейчас)', 'Have we been working'],
                        ['Ты работал? (длится по сейчас)', 'Have you been working'],
                        ['Они работали? (длится по сейчас)', 'Have they been working'],
                        ['Он работал? (длится по сейчас)', 'Has he been working'],
                        ['Она работала? (длится по сейчас)', 'Has she been working'],
                        ['Это работало? (длится по сейчас)', 'Has it been working'],
                    ],
                },
                'PastPerfectContinuous': {
                    '+': [
                        ['Я работал (продолжительное прозапрошлое)', 'I had been working'],
                        ['Мы работали (продолжительное прозапрошлое)', 'We had been working'],
                        ['Ты работал (продолжительное прозапрошлое)', 'You had been working'],
                        ['Они работали (продолжительное прозапрошлое)', 'They had been working'],
                        ['Он работал (продолжительное прозапрошлое)', 'He had been working'],
                        ['Она работала (продолжительное прозапрошлое)', 'She had been working'],
                        ['Это работало (продолжительное прозапрошлое)', 'It had been working'],
                    ],
                    '-': [
                        ['Я не работал (продолжительное прозапрошлое)', 'I hadn\'t been working'],
                        ['Мы не работали (продолжительное прозапрошлое)', 'We hadn\'t been working'],
                        ['Ты не работал (продолжительное прозапрошлое)', 'You hadn\'t been working'],
                        ['Они не работали (продолжительное прозапрошлое)', 'They hadn\'t been working'],
                        ['Он не работал (продолжительное прозапрошлое)', 'He hadn\'t been working'],
                        ['Она не работала (продолжительное прозапрошлое)', 'She hadn\'t been working'],
                        ['Это не работало (продолжительное прозапрошлое)', 'It hadn\'t been working'],
                    ],
                    '?': [
                        ['Я работал? (продолжительное прозапрошлое)', 'Had I been working'],
                        ['Мы работали? (продолжительное прозапрошлое)', 'Had we been working'],
                        ['Ты работал? (продолжительное прозапрошлое)', 'Had you been working'],
                        ['Они работали? (продолжительное прозапрошлое)', 'Had they been working'],
                        ['Он работал? (продолжительное прозапрошлое)', 'Had he been working'],
                        ['Она работала? (продолжительное прозапрошлое)', 'Had she been working'],
                        ['Это работало? (продолжительное прозапрошлое)', 'Had it been working'],
                    ],
                },
                'FuturePerfectContinuous': {
                    '+': [
                        ['Я буду работающим (продолжительное будет длиться)', 'I will have been working'],
                        ['Мы будем работающими (продолжительное будет длиться)', 'We will have been working'],
                        ['Ты будешь работающим (продолжительное будет длиться)', 'You will have been working'],
                        ['Они будут работающими (продолжительное будет длиться)', 'They will have been working'],
                        ['Он будует работающим (продолжительное будет длиться)', 'He will have been working'],
                        ['Она будует работающей (продолжительное будет длиться)', 'She will have been working'],
                        ['Это будет работающим (продолжительное будет длиться)', 'It will have been working'],
                    ],
                    '-': [
                        ['Я не буду работающим  (продолжительное не будет длиться)', 'I won\'t have been working'],
                        ['Мы не будем работающими  (продолжительное не будет длиться)', 'We won\'t have been working'],
                        ['Ты не будешь работающим  (продолжительное не будет длиться)', 'You won\'t have been working'],
                        ['Они не будут работающими  (продолжительное не будет длиться)', 'They won\'t have been working'],
                        ['Он не будует работающим  (продолжительное не будет длиться)', 'He won\'t have been working'],
                        ['Она не будует работающей  (продолжительное не будет длиться)', 'She won\'t have been working'],
                        ['Это не будет работающим (продолжительное не будет длиться)', 'It won\'t have been working'],
                    ],
                    '?': [
                        ['Я буду работающим? (продолжительное будет длиться)', 'Will I have been working'],
                        ['Мы будем работающими? (продолжительное будет длиться)', 'Will we have been working'],
                        ['Ты будешь работающим? (продолжительное будет длиться)', 'Will you have been working'],
                        ['Они будут работающими? (продолжительное будет длиться)', 'Will they have been working'],
                        ['Он будует работающим? (продолжительное будет длиться)', 'Will he have been working'],
                        ['Она будует работающей? (продолжительное будет длиться)', 'Will she have been working'],
                        ['Это будет работающим? (продолжительное будет длиться)', 'Will it have been working'],
                    ],
                },
            }
        },
        'ua': {
            'languages': ['Українська', 'Російська'],
            'campaign_title': 'Кампанія',
            'mode_title': 'Варіанти',
            'settings_title': 'Настройки',
            'run_round_title': 'Запустити раунд',
            'exit_title': 'Вихід',
            'sentences_pair': {
                'PresentContinuous': {
                    '+': [
                        ['я працюю (стан)', 'I am working'],
                        ['Ми працюємо (стан)', 'We are working'],
                        ['Вони працюють (стан)', 'They are working'],
                        ['Ти працюєш (стан)', 'You are working'],
                        ['Він працює (стан)', 'He is working'],
                        ['Вона працює (стан)', 'She is working'],
                        ['Це працює (стан)', 'It is working'],
                    ],
                    '-': [
                        ['я не працюю (стан)', 'I amn\'t working'],
                        ['Ми не працюємо (стан)', 'We aren\'t working'],
                        ['Вони не працюють (стан)', 'They aren\'t working'],
                        ['Ти не працюєш (стан)', 'You aren\'t working'],
                        ['Він не працює (стан)', 'He isn\'t working'],
                        ['Вона не працює (стан)', 'She isn\'t working'],
                        ['Це не працює (стан)', 'It isn\'t working'],
                    ],
                    '?': [
                        ['Я працюю? (Стан)', 'Am I working'],
                        ['Ми працюємо? (Стан)', 'Are we working'],
                        ['Вони працюють? (Стан)', 'Are they working'],
                        ['Ти працюєш? (Стан)', 'Are you working'],
                        ['Він працює? (Стан)', 'Is he working'],
                        ['Вона працює? (Стан)', 'Is she working'],
                        ['Це працює? (Стан)', 'Is it working'],
                    ],
                },
                'PastContinuous': {
                    '+': [
                        ['я працював (стан)', 'I was working'],
                        ['Ми працювали (стан)', 'We were working'],
                        ['Вони працювали (стан)', 'They were working'],
                        ['Ти працював (стан)', 'You were working'],
                        ['Він працював (стан)', 'He was working'],
                        ['Вона працювала (стан)', 'She was working'],
                        ['Це працювало (стан)', 'It was working'],
                    ],
                    '-': [
                        ['я не працював (стан)', 'I wasn\'t working'],
                        ['Ми не працювали (стан)', 'We weren\'t working'],
                        ['Вони не працювали (стан)', 'They weren\'t working'],
                        ['Ти не працював (стан)', 'You weren\'t working'],
                        ['Він не працював (стан)', 'He wasn\'t working'],
                        ['Вона не працювала (стан)', 'She wasn\'t working'],
                        ['Це не працювало (стан)', 'It wasn\'t working'],
                    ],
                    '?': [
                        ['Я працював? (Стан)', 'Was I working'],
                        ['Ми працювали? (Стан)', 'Were we working'],
                        ['Вони працювали? (Стан)', 'Were they working'],
                        ['Ти працював? (Стан)', 'Were you working'],
                        ['Він працював? (Стан)', 'Was he working'],
                        ['Вона працювала? (Стан)', 'Was she working'],
                        ['Це працювало? (Стан)', 'Was it working'],
                    ],
                },
                'FutureContinuous': {
                    '+': [
                        ['Я буду працювати (стан)', 'I will be working'],
                        ['Ти будеш працювати (стан)', 'You will be working'],
                        ['Вони будуть працювати (стан)', 'They will be working'],
                        ['Ми будемо працювати (стан)', 'We will be working'],
                        ['Він буде працювати (стан)', 'He will be working'],
                        ['Вона буде працювати (стан)', 'She will be working'],
                        ['Це буде працювати (стан)', 'It will be working'],
                    ],
                    '-': [
                        ['Я не буду працювати (стан)', 'I won\'t be working'],
                        ['Ти не будеш працювати (стан)', 'You won\'t be working'],
                        ['Вони не будуть працювати (стан)', 'They won\'t be working'],
                        ['Ми не будемо працювати (стан)', 'We won\'t be working'],
                        ['Він не буде працювати (стан)', 'He won\'t be working'],
                        ['Вона не буде працювати (стан)', 'She won\'t be working'],
                        ['Це не буде працювати (стан)', 'It won\'t be working'],
                    ],
                    '?': [
                        ['Я буду працювати? (Стан)', 'Will I be working'],
                        ['Ти будеш працювати? (Стан)', 'Will you be working'],
                        ['Вони будуть працювати? (Стан)', 'Will they be working'],
                        ['Ми будемо працювати? (Стан)', 'Will we be working'],
                        ['Він буде працювати? (Стан)', 'Will he be working'],
                        ['Вона буде працювати? (Стан)', 'Will she be working'],
                        ['Це буде працювати? (Стан)', 'Will it be working'],
                    ],
                },

                'PresentIndefinite': {
                    '+': [
                        ['я працюю (повторюване)', 'I work'],
                        ['Ми працюємо (повторюване)', 'We work'],
                        ['Вони працюють (повторюване)', 'They work'],
                        ['Ти працюєш (повторюване)', 'You work'],
                        ['Він працює (повторюване)', 'He works'],
                        ['Вона працює (повторюване)', 'She works'],
                        ['Це працює (повторюване)', 'It works'],
                    ],
                    '-': [
                        ['я не працюю (повторюване)', 'I don\'t work'],
                        ['Ми не працюємо (повторюване)', 'We don\'t work'],
                        ['Вони не працюють (повторюване)', 'They don\'t work'],
                        ['Ти не працюєш (повторюване)', 'You don\'t work'],
                        ['Він не працює (повторюване)', 'He doesn\'t work'],
                        ['Вона не працює (повторюване)', 'She doesn\'t work'],
                        ['Це не працює (повторюване)', 'It doesn\'t work'],
                    ],
                    '?': [
                        ['я працюю? (повторюване)', 'Do I work'],
                        ['Ми працюємо? (повторюване)', 'Do we work'],
                        ['Вони працюють? (повторюване)', 'Do they work'],
                        ['Ти працюєш? (повторюване)', 'Do you work'],
                        ['Він працює? (повторюване)', 'Does he work'],
                        ['Вона працює? (повторюване)', 'Does she work'],
                        ['Це працює? (повторюване)', 'Does it work'],
                    ],
                },
                'PastIndefinite': {
                    '+': [
                        ['я працював (повторюване)', 'I worked'],
                        ['Він працював (повторюване)', 'He worked'],
                        ['Ми працювали (повторюване)', 'We worked'],
                        ['Вони працювали (повторюване)', 'They worked'],
                        ['Ти працював (повторюване)', 'You worked'],
                        ['Вона працювала (повторюване)', 'She worked'],
                        ['Це працювало (повторюване)', 'It worked'],
                    ],
                    '-': [
                        ['Я не працював (повторюване)', 'I didn\'t work'],
                        ['Ми не працювали (повторюване)', 'We didn\'t work'],
                        ['Вони не працювали (повторюване)', 'They didn\'t work'],
                        ['Ти не працював (повторюване)', 'You didn\'t work'],
                        ['Він не працював (повторюваний)', 'He didn\'t work'],
                        ['Вона не працювала (повторюване)', 'She didn\'t work'],
                        ['Це не працювало (повторюване)', 'It didn\'t work'],
                    ],
                    '?': [# tysic
                        ['я працював? (повторюване)', 'Did I work'],
                        ['Ми працювали? (повторюване)', 'Did we work'],
                        ['Вони працювали? (повторюване)', 'Did they work'],
                        ['Ти працював? (повторюване)', 'Did you work'],
                        ['Він працював? (повторюване)', 'Did he work'],
                        ['Вона працювала? (повторюване)', 'Did she work'],
                        ['Це працювало? (повторюване)', 'Did it work'],
                    ],
                },
                'FutureIndefinite': {
                    '+': [
                        ['Я працюватиму (повторюване)', 'I will work'],
                        ['Ми будемо працювати (повторюване)', 'We will work'],
                        ['Вони працюватиму (повторюване)', 'They will work'],
                        ['Ти працюватимеш (повторюється)', 'You will work'],
                        ['Він працюватиме (повторюється)', 'He will work'],
                        ['Вона працюватиме (повторюється)', 'She will work'],
                        ['Це буде працювати (повторюване)', 'It will work'],
                    ],
                    '-': [
                        ['Я не працюватиму (повторюване)', 'I won\'t work'],
                        ['Ми не будемо працювати (повторюване)', 'We won\'t work'],
                        ['Вони не працюватиму (повторюване)', 'They won\'t work'],
                        ['Ти не працюватимеш (повторюване)', 'You won\'t work'],
                        ['Він не працюватиме (повторюється)', 'He won\'t work'],
                        ['Вона не працюватиме (повторюється)', 'She won\'t work'],
                        ['Це не буде працювати (повторюване)', 'It won\'t work'],
                    ],
                    '?': [
                        ['Я буду працювати? (повторюване)', 'Will I work'],
                        ['Ми будемо працювати? (повторюване)', 'Will we work'],
                        ['Вони працюватиму? (повторюване)', 'Will they work'],
                        ['Ти будеш працювати? (повторюване)', 'Will you work'],
                        ['Він буде працювати? (повторюване)', 'Will he work'],
                        ['Вона працюватиме? (повторюване)', 'Will she work'],
                        ['Це працюватиме? (повторюване)', 'Will it work'],
                    ],
                },

                'PresentPerfect': {
                    '+': [
                        ['Я працював (є досвід)', 'I have worked'],
                        ['Ми працювали (є досвід)', 'We have worked'],
                        ['Ти працював (є досвід)', 'You have worked'],
                        ['Вони працювали (є досвід)', 'They have worked'],
                        ['Він працював (є досвід)', 'He has worked'],
                        ['Вона працювала (є досвід)', 'She has worked'],
                        ['Це працювало (є досвід)', 'It has worked'],
                    ],
                    '-': [
                        ['Я не працював (немає досвіду)', 'I haven\'t worked'],
                        ['Ми не працювали (немає досвіду)', 'We haven\'t worked'],
                        ['Ти не працював (немає досвіду)', 'You haven\'t worked'],
                        ['Вони не працювали (немає досвіду)', 'They haven\'t worked'],
                        ['Він не працював (немає досвіду)', 'He hasn\'t worked'],
                        ['Вона не працювала (немає досвіду)', 'She hasn\'t worked'],
                        ['Це не працювало (немає досвіду)', 'It hasn\'t worked'],
                    ],
                    '?': [
                        ['Я працював? (Є досвід)', 'Have I worked'],
                        ['Ми працювали? (Є досвід)', 'Have we worked'],
                        ['Ти працював? (Є досвід)', 'Have you worked'],
                        ['Вони працювали? (Є досвід)', 'Have they worked'],
                        ['Він працював? (Є досвід)', 'Has he worked'],
                        ['Вона працювала? (Є досвід)', 'Has she worked'],
                        ['Це працювало? (Є досвід)', 'Has it worked'],
                    ],
                },
                'PastPerfect': {
                    '+': [
                        ['Я працював (поза минуле)', 'I had worked'],
                        ['Ми працювали (позаминуле)', 'We had worked'],
                        ['Ти працював (поза минуле)', 'You had worked'],
                        ['Вони працювали (поза минуле)', 'They had worked'],
                        ['Він працював (поза минуле)', 'He had worked'],
                        ['Вона працювала (позаминуле)', 'She had worked'],
                        ['Це працювало (позаминуле)', 'It had worked'],
                    ],
                    '-': [
                        ['Я не працював (поза минуле)', 'I hadn\'t worked'],
                        ['Ми не працювали (позаминуле)', 'We hadn\'t worked'],
                        ['Ти не працював (поза минуле)', 'You hadn\'t worked'],
                        ['Вони не працювали (поза минуле)', 'They hadn\'t worked'],
                        ['Він не працював (поза минуле)', 'He hadn\'t worked'],
                        ['Вона не працювала (поза минуле)', 'She hadn\'t worked'],
                        ['Це не працювало (позаминуле)', 'It hadn\'t worked'],
                    ],
                    '?': [
                        ['Я працював? (позаминуле)', 'Had I worked'],
                        ['Ми працювали? (позаминуле)', 'Had we worked'],
                        ['Ти працював? (позаминуле)', 'Had you worked'],
                        ['Вони працювали? (позаминуле)', 'Had they worked'],
                        ['Він працював? (позаминуле)', 'Had he worked'],
                        ['Вона працювала? (позаминуле)', 'Had she worked'],
                        ['Це працювало? (позаминуле)', 'Had it worked'],
                    ],
                },
                'FuturePerfect': {
                    '+': [
                        ['Я працюватиму (на той час)', 'I will have worked'],
                        ['Ми будемо працювати (на той час)', 'We will have worked'],
                        ['Ти працюватимеш (на той час)', 'You will have worked'],
                        ['Вони працюватиму (на той час)', 'They will have worked'],
                        ['Він працюватиме (на той час)', 'He will have worked'],
                        ['Вона буде працювати (на той час)', 'She will have worked'],
                        ['Це працюватиме (на той час)', 'It will have worked'],
                    ],
                    '-': [
                        ['Я не працюватиму (на той час)', 'I won\'t have worked'],
                        ['Ми не працюватимемо (на той час)', 'We won\'t have worked'],
                        ['Ти не працюватимеш (на той час)', 'You won\'t have worked'],
                        ['Вони не працюватиму (на той час)', 'They won\'t have worked'],
                        ['Він не працюватиме (на той час)', 'He won\'t have worked'],
                        ['Вона не працюватиме (на той час)', 'She won\'t have worked'],
                        ['Це не працюватиме (на той час)', 'It won\'t have worked'],
                    ],
                    '?': [
                        ['Я буду працювати? (до того часу)', 'Will I have worked'],
                        ['Ми будемо працювати? (до того часу)', 'Will we have worked'],
                        ['Ти будеш працювати? (до того часу)', 'Will you have worked'],
                        ['Вони працюватиму? (до того часу)', 'Will they have worked'],
                        ['Він буде працювати? (до того часу)', 'Will he have worked'],
                        ['Вона працюватиме? (до того часу)', 'Will she have worked'],
                        ['Це працюватиме? (до того часу)', 'Will it have worked'],
                    ],
                },

                'PresentPerfectContinuous': {
                    '+': [
                        ['Я працював (триває зараз)', 'I have been working'],
                        ['Ми працювали (триває зараз)', 'We have been working'],
                        ['Ти працював (триває зараз)', 'You have been working'],
                        ['Вони працювали (триває зараз)', 'They have been working'],
                        ['Він працював (триває зараз)', 'He has been working'],
                        ['Вона працювала (триває зараз)', 'She has been working'],
                        ['Це працювало (триває зараз)', 'It has been working'],
                    ],
                    '-': [
                        ['Я не працював (не тривало зараз)', 'I haven\'t been working'],
                        ['Ми не працювали (не тривало зараз)', 'We haven\'t been working'],
                        ['Ти не працював (не тривало дотепер)', 'You haven\'t been working'],
                        ['Вони не працювали (не тривало дотепер)', 'They haven\'t been working'],
                        ['Він не працював (не тривало дотепер)', 'He hasn\'t been working'],
                        ['Вона не працювала (не тривало дотепер)', 'She hasn\'t been working'],
                        ['Це не працювало (не тривало дотепер)', 'It hasn\'t been working'],
                    ],
                    '?': [
                        ['Я працював? (триває зараз)', 'Have I been working'],
                        ['Ми працювали? (триває зараз)', 'Have we been working'],
                        ['Ти працював? (триває зараз)', 'Have you been working'],
                        ['Вони працювали? (триває зараз)', 'Have they been working'],
                        ['Він працював? (триває зараз)', 'Has he been working'],
                        ['Вона працювала? (триває зараз)', 'Has she been working'],
                        ['Це працювало? (триває зараз)', 'Has it been working'],
                    ],
                },
                'PastPerfectContinuous': {
                    '+': [
                        ['Я працював (тривале прозапрошене)', 'I had been working'],
                        ['Ми працювали (тривале прозапрошене)', 'We had been working'],
                        ['Ти працював (тривале прозапрошене)', 'You had been working'],
                        ['Вони працювали (тривале прозапрошене)', 'They had been working'],
                        ['Він працював (тривале прозапрошене)', 'He had been working'],
                        ['Вона працювала (тривале прозапрошене)', 'She had been working'],
                        ['Це працювало (тривале прозапрошене)', 'It had been working'],
                    ],
                    '-': [
                        ['Я не працював (тривале прозапрошене)', 'I hadn\'t been working'],
                        ['Ми не працювали (тривале прозапрошене)', 'We hadn\'t been working'],
                        ['Ти не працював (тривале прозапрошене)', 'You hadn\'t been working'],
                        ['Вони не працювали (тривале прозапрошене)', 'They hadn\'t been working'],
                        ['Він не працював (тривале прозапрошене)', 'He hadn\'t been working'],
                        ['Вона не працювала (тривале прозапрошене)', 'She hadn\'t been working'],
                        ['Це не працювало (тривале прозапрошене)', 'It hadn\'t been working'],
                    ],
                    '?': [
                        ['Я працював? (тривале прозапрошене)', 'Had I been working'],
                        ['Ми працювали? (тривале прозапрошене)', 'Had we been working'],
                        ['Ти працював? (тривале прозапрошене)', 'Had you been working'],
                        ['Вони працювали? (тривале прозапрошене)', 'Had they been working'],
                        ['Він працював? (тривале прозапрошене)', 'Had he been working'],
                        ['Вона працювала? (тривале прозапрошене)', 'Had she been working'],
                        ['Це працювало? (тривале прозапрошене)', 'Had it been working'],
                    ],
                },
                'FuturePerfectContinuous': {
                    '+': [
                        ['Я буду працюючим (тривале триватиме)', 'I will have been working'],
                        ['Ми будемо працюючими (тривале триватиме)', 'We will have been working'],
                        ['Ти будеш працюючим (тривале триватиме)', 'You will have been working'],
                        ['Вони будуть працюючими (тривале триватиме)', 'They will have been working'],
                        ['Він будує працюючим (тривале триватиме)', 'He will have been working'],
                        ['Вона будує працюючою (тривале триватиме)', 'She will have been working'],
                        ['Це буде працюючим (тривале триватиме)', 'It will have been working'],
                    ],
                    '-': [
                        ['Я не буду працюючим (тривале не триватиме)', 'I won\'t have been working'],
                        ['Ми не будемо працюючими (тривале не триватиме)', 'We won\'t have been working'],
                        ['Ти не будеш працюючим (тривале не триватиме)', 'You won\'t have been working'],
                        ['Вони не будуть працюючими (тривале не триватиме)', 'They won\'t have been working'],
                        ['Він не працює (тривале не триватиме)', 'He won\'t have been working'],
                        ['Вона не працює (тривале не триватиме)', 'She won\'t have been working'],
                        ['Це не буде працюючим (тривале не триватиме)', 'It won\'t have been working'],
                    ],
                    '?': [
                        ['Я буду працюючим? (тривале триватиме)', 'Will I have been working'],
                        ['Ми будемо працюючими? (тривале триватиме)', 'Will we have been working'],
                        ['Ти будеш працюючим? (тривале триватиме)', 'Will you have been working'],
                        ['Вони будуть працюючими? (тривале триватиме)', 'Will they have been working'],
                        ['Він будує працюючим? (тривале триватиме)', 'Will he have been working'],
                        ['Вона будує працюючою? (тривале триватиме)', 'Will she have been working'],
                        ['Це буде працюючим? (тривале триватиме) ', 'Will it have been working'],
                    ],
                },
            }
        }
    }
    selected_language = 'Русский'
    language_translate = { 'ua': 'ua',
                           'Украинский': 'ua',
                           'Українська': 'ua',
                           'ru': 'ru',
                           'Російська': 'ru',
                           'Русский': 'ru',}
    def update_language(self, text):
        self.selected_language = text

    def get_text_from_map(self, title):
        return self.text_map[self.language_translate[self.selected_language]][title]

    def get_sentences_pair(self):
        return self.text_map[self.language_translate[self.selected_language]]['sentences_pair']

class CustomSpinnerOption(SpinnerOption):
    # Set the background image for the option
    background_normal = 'imgs/main_button_normal.png'
    background_down = 'imgs/main_button_down.png'
    color = [0, 0, 0, 1]
    font_size = sp(24)

class LanguageScreen(Screen):
    def __init__(self, lang_data, screen_manager, **kwargs):
        self.screen_manager = screen_manager
        super().__init__(**kwargs)
        self.spinner = Spinner(
            text=lang_data.selected_language,
            font_size='24sp',
            background_normal='imgs/main_button_down.png',
            values=lang_data.get_text_from_map(title='languages'),
            size_hint=(0.5, 0.1),
            color=[0, 0, 0, 1],
            on_press=self.screen_manager.play_toggle,
            pos_hint={'center_x': 0.5, 'center_y': 0.4},
        )
        self.spinner.option_cls = CustomSpinnerOption
        self.add_widget(Image(source='imgs/background_mode.png', allow_stretch=True, keep_ratio=False))
        self.add_widget(Image(source='imgs/bilcko_logo.png', allow_stretch=True,
                            pos_hint={'center_x': 0.5, 'center_y': 0.7},
                              size_hint=(0.5, 0.3), keep_ratio=False))
        self.lang_data = lang_data
        self.add_widget(self.spinner)
        self.add_back_btn()

    def update_language(self):
        self.lang_data.selected_language = self.spinner.text
        self.screen_manager.rebuild(self.spinner.text)

    def add_back_btn(self):
        self.button = BackButton(size_hint=[.2, .1], size=(80, 80), pos_hint={'right': 0.99, 'top': 0.99})
        self.button.bind(on_release=self.goto_main,
                            on_press=self.screen_manager.play_button)
        self.add_widget(self.button)


    def goto_main(self, instance):
        self.update_language()
        animation = Animation(y=-180, duration=0.5)
        animation.start(self)
        self.screen_manager.current = 'screen1'
